; domain
(define (domain elevators)
    (:requirements :typing)
    (:types elevator passenger num - object)

    (:predicates
        (passenger-at ?person - passenger ?floor - num)
        (boarded ?person - passenger ?lift - elevator)
        (lift-at ?lift - elevator ?floor - num)
        (next ?n1 - num ?n2 - num)
    )

    (:action move-up
        :parameters (?lift - elevator ?cur ?nxt - num)
        :precondition (and 
            (lift-at ?lift ?cur) 
            (next ?cur ?nxt)
        )
        :effect (and 
            (not (lift-at ?lift ?cur)) 
            (lift-at ?lift ?nxt)
        )
    )

    (:action move-down
        :parameters (?lift - elevator ?cur ?nxt - num)
        :precondition (and 
            (lift-at ?lift ?cur) 
            (next ?nxt ?cur)
        )
        :effect (and 
            (not (lift-at ?lift ?cur)) 
            (lift-at ?lift ?nxt)
        )
    )

    (:action board
        :parameters (?person - passenger ?floor - num ?lift - elevator)
        :precondition (and 
            (lift-at ?lift ?floor)
            (passenger-at ?person ?floor)
        )
        :effect (and 
            (not (passenger-at ?person ?floor))
            (boarded ?person ?lift)
        )
    )
    
    (:action leave
        :parameters (?person - passenger ?floor - num ?lift - elevator)
        :precondition (and 
            (lift-at ?lift ?floor)
            (boarded ?person ?lift)
        )
        :effect (and 
            (passenger-at ?person ?floor)
            (not (boarded ?person ?lift))
        )
    )

)

; problem
(define (problem elevators_problem)
    (:domain elevators)
    (:objects
        floor1 floor2 floor3 floor4 floor5 - num
        rahul raju shyam - passenger
        e1 e2 - elevator
    )
    (:init
        (next floor1 floor2) (next floor2 floor3) (next floor3 floor4) (next floor4 floor5)
        (lift-at e1 floor1) (lift-at e2 floor5)
        (passenger-at rahul floor2) (passenger-at raju floor2) (passenger-at shyam floor4)
    )
    (:goal (and
        (passenger-at rahul floor1)
        (passenger-at raju floor5)
        (passenger-at shyam floor3)
        )
    )
)

; plan
1. (move-down e2 floor5 floor4)
   deleted: (lift-at e2 floor5)
   added: (lift-at e2 floor4)
   goals met: 0 of 3
2. (move-up e1 floor1 floor2)
   deleted: (lift-at e1 floor1)
   added: (lift-at e1 floor2)
   goals met: 0 of 3
3. (board shyam floor4 e2)
   deleted: (passenger-at shyam floor4)
   added: (boarded shyam e2)
   goals met: 0 of 3
4. (board rahul floor2 e1)
   deleted: (passenger-at rahul floor2)
   added: (boarded rahul e1)
   goals met: 0 of 3
5. (board raju floor2 e1)
   deleted: (passenger-at raju floor2)
   added: (boarded raju e1)
   goals met: 0 of 3
6. (move-down e2 floor4 floor3)
   deleted: (lift-at e2 floor4)
   added: (lift-at e2 floor3)
   goals met: 0 of 3
7. (move-up e1 floor2 floor3)
   deleted: (lift-at e1 floor2)
   added: (lift-at e1 floor3)
   goals met: 0 of 3
8. (leave shyam floor3 e2)
   deleted: (boarded shyam e2)
   added: (passenger-at shyam floor3)
   goals met: 1 of 3
9. (move-up e1 floor3 floor4)
   deleted: (lift-at e1 floor3)
   added: (lift-at e1 floor4)
   goals met: 1 of 3
10. (move-up e1 floor4 floor5)
   deleted: (lift-at e1 floor4)
   added: (lift-at e1 floor5)
   goals met: 1 of 3
11. (leave raju floor5 e1)
   deleted: (boarded raju e1)
   added: (passenger-at raju floor5)
   goals met: 2 of 3
12. (move-down e1 floor5 floor4)
   deleted: (lift-at e1 floor5)
   added: (lift-at e1 floor4)
   goals met: 2 of 3
13. (move-down e1 floor4 floor3)
   deleted: (lift-at e1 floor4)
   added: (lift-at e1 floor3)
   goals met: 2 of 3
14. (move-down e1 floor3 floor2)
   deleted: (lift-at e1 floor3)
   added: (lift-at e1 floor2)
   goals met: 2 of 3
15. (move-down e1 floor2 floor1)
   deleted: (lift-at e1 floor2)
   added: (lift-at e1 floor1)
   goals met: 2 of 3
16. (leave rahul floor1 e1)
   deleted: (boarded rahul e1)
   added: (passenger-at rahul floor1)
   goals met: 3 of 3
